{
    "Home": {
        "welcome": "Hallo🖖!",
        "i_am": "Ich bin Ben",
        "about_one": "Full Stack Entwickler",
        "about_two": "UI Designer",
        "my_stack": "Mein Stack",
        "intro_one": "Ich bin ein Webentwickler, spezialisiert auf .NET, React und Flutter. Leidenschaftlich daran interessiert, innovative Lösungen zu schaffen, die Funktionalität und Design kombinieren.",
        "intro_two": "Mit Erfahrung in Frontend und Backend Projekten arbeite ich gerne im Team und überwinde technologische Herausforderungen, um Produkte von hoher Qualität zu liefern.",
        "more_about_me": "Mehr über mich",
        "more_about_me_one": "Von der Arbeit mit Arduinos bis hin zur Entwicklung von Lösungen in Deutschland: Meine Reise vereint Neugier, Technologie und eine Leidenschaft für wirkungsvolle Entwicklungen.",
        "my_exp": "Meine Erfahrung",
        "available": "Verfügbar",
        "adata_name": "Adata Software GmbH",
        "net_dev": "ASP.NET Core Entwickler",
        "adata_time_span": "Juli 2023 - Juni 2024"
    },
    "AboutMe": {
        "about_me": "Über mich",
        "born_in_munich": "Ich wurde in München geboren und in Argentinien aufgewachsen.",
        "passion_technology_books": "Seit meiner Kindheit bin ich begeistert von Technologie und Geschichtsbüchern (und Autos).",
        "curiosity_how_things_work": "Ich habe mich immer gefragt, wie der Fernseher im Wohnzimmer oder das Autoradio funktioniert, wie sich Dinge entwickeln und verbessern.",
        "teenage_internet_games": "Meine Jugend war geprägt vom Internet und Videospielen. Im Interact-Club meiner Stadt fand ich meinen Platz, indem ich Beiträge für das PR-Komitee entwarf.",
        "student_exchange_bremen": "Durch Interact nahm ich an einem Schüleraustausch in Deutschland teil, wo ich ein Jahr in Bremen verbrachte.",
        "pandemic_change_programming": "Zurück in Tucumán und an der Universität fand mich die Pandemie mit wenig Motivation für mein Wirtschaftsstudium. Damals begann ich, mich mit Programmierung und Schnittstellendesign zu beschäftigen.",
        "exploring_react_dotnet_ui": "Durch Kurse und Selbststudium habe ich React, .NET und UI-Design erforscht, Bereiche, die schnell zu meiner Leidenschaft und zum Schwerpunkt meiner beruflichen Entwicklung wurden.",
        "working_holiday_visa": "In der Hoffnung, Deutschland erneut zu besuchen, beantragte ich ein Working-Holiday-Visum. Dort arbeitete ich ein Jahr bei Adata Software GmbH in Verden, Niedersachsen.",
        "developing_hr_software": "Ich war an der Entwicklung und Unterstützung des Mitarbeiterportals beteiligt, einer HR-Software, die kleinen und mittleren Unternehmen hilft, ihr Personal zu verwalten.",
        "facing_challenges": "Während dieser Zeit stand ich vor technischen (sprachlichen) und kreativen Herausforderungen, aber jede Aufgabe brachte mir immense Befriedigung.",
        "current_goal": "Mein aktuelles Ziel",
        "current_learning_focus": "Ich konzentriere mich darauf, in Bereichen, in denen ich mehr Vorbereitung brauche, weiter zu lernen und mein Wissen zu zertifizieren.",
        "short_term_goal": "Mein kurzfristiges Ziel ist es, den Hosting- und Veröffentlichungsprozess von Anwendungen zu meistern und gleichzeitig meine Fähigkeiten in .NET und ReactJS zu stärken.",
        "long_term_goal": "Langfristig strebe ich an, Entwicklungsteams zu leiten und Junior-Entwickler zu betreuen, da ich glaube, dass meine Erfahrung und Herangehensweise einen Unterschied in ihrem beruflichen Wachstum machen können.",
        "return_button": "Zurück"
    },
    "Exp": {
        "adata_title": "Adata Software Gmbh",
        "adata_time_span": "JUL '23 – JUN '24",
        "adata_description": "Ich habe ein Jahr lang bei Adata in Verden (Niedersachsen) gearbeitet. Dort habe ich mit zwei Entwicklern an der Entwicklung und Unterstützung des Mitarbeiterportals gearbeitet.",
        "what_is_mitarbeiter_portal": "Was ist das Mitarbeiterportal? Es ist ein umfassendes HR-Tool, das kleinen und mittleren Unternehmen hilft, ihr Personal effizient zu verwalten. Von der Terminplanung bis zur internen Kommunikation ist dieses Portal das organisatorische Rückgrat vieler Unternehmen.",
        "adata_year_learnings": "Dieses Jahr bei Adata hat mir nicht nur Technologie beigebracht; es hat mir ermöglicht, den greifbaren Einfluss zu verstehen, den gut gestaltete Software auf das Arbeitsleben der Nutzer haben kann.",
        "contributions_title": "Einige meiner Beiträge",
        "redesign_ui": "Überarbeitung von Teilen der Benutzeroberfläche des Portals mit ReactJS, um die Benutzererfahrung durch die Integration von Bibliotheken wie KendoUI und Bootstrap zu verbessern.",
        "backend_features": "Aktualisierung und Implementierung neuer Backend-Funktionen in ASP.NET Core MVC, um den Anforderungen der Kunden gerecht zu werden.",
        "mobile_development_flutter": "Entwicklung mobiler Anwendungen in Flutter unter Verwendung von Dart, Verbindung von Komponenten mit Backendsystemen in .NET über RESTful APIs.",
        "database_optimizations": "Verwendung von LINQ und HeidiSQL für effiziente Datenbankabfragen und Leistungsverbesserungen, Sicherstellung von Skalierbarkeit und Datenoptimierung.",
        "scrum_practices": "Arbeiten mit Scrum-Methoden, Aufgabenverwaltung in JIRA, Teilnahme an Code-Reviews und Anwendung bewährter Entwicklungspraktiken.",
        "return_button": "Zurück"
    }
}
