{
    "Home": {
        "welcome": "Hello🖖!",
        "i_am": "I am Ben",
        "about_one": "Full Stack Developer",
        "about_two": "UI Designer",
        "my_stack": "My Stack",
        "intro_one": "I am a web developer specialized in .NET, React, and Flutter. Passionate about creating innovative solutions that combine functionality and design.",
        "intro_two": "With experience in frontend and backend projects, I enjoy working in teams and overcoming technological challenges to deliver high quality products.",
        "more_about_me": "More about me",
        "more_about_me_one": "🚦 From programming Arduinos to working in Germany.",
        "more_about_me_two": "🔍 I love finding the best solution for every challenge.",
        "more_about_me_three": "📈 Always looking to improve and learn something new.",
        "my_exp": "My experience",
        "available": "Available",
        "adata_name": "Adata Software GmbH",
        "net_dev": "ASP.NET Core Developer",
        "adata_time_span": "July 2023 - June 2024"
    },
    "AboutMe": {
        "about_me": "About Me",
        "born_in_munich": "I was born in Munich, Germany, and raised in Argentina.",
        "passion_technology_books": "Since childhood, I have been passionate about technology and history books (and cars).",
        "curiosity_how_things_work": "I always wondered how the TV in the living room or the car radio worked, how things evolved and improved.",
        "teenage_internet_games": "My teenage years were marked by the internet and video games. At my city's Interact club, I found my place designing posts for the public relations committee.",
        "student_exchange_bremen": "Through Interact, I participated in a student exchange in Germany, where I spent a year in Bremen.",
        "pandemic_change_programming": "Back in Tucumán and at university, the pandemic found me with little motivation studying economics. That's when I started exploring programming and interface design.",
        "exploring_react_dotnet_ui": "Through courses and self-learning, I explored React, .NET, and UI design, areas that quickly became my passion and the focus of my professional development.",
        "working_holiday_visa": "Eager to visit Germany again, I applied for a working-holiday visa. Once there, I worked for a year at Adata Software GmbH in Verden, Lower Saxony.",
        "developing_hr_software": "I was involved in the development and support of the Mitarbeiter Portal, an HR software that helps small and medium-sized companies manage their staff.",
        "facing_challenges": "During that time, I faced technical (linguistic) and creative challenges, but every task left me with immense satisfaction.",
        "current_goal": "My Current Goal",
        "current_learning_focus": "I am focused on continuing to learn in areas where I need more preparation and certifying my knowledge.",
        "short_term_goal": "My short-term goal is to master the hosting and publishing process of applications while strengthening my skills in .NET and ReactJS.",
        "long_term_goal": "In the long term, I aspire to lead development teams and mentor junior developers because I believe my experience and approach can make a difference in their professional growth.",
        "return_button": "Back"
    },
    "Exp": {
        "adata_title": "Adata Software Gmbh",
        "adata_time_span": "JUL '23 – JUN '24",
        "adata_description": "I worked for a year at Adata in Verden (Lower Saxony). There, I collaborated with two developers on the development and support of the Mitarbeiter Portal.",
        "what_is_mitarbeiter_portal": "What is the Mitarbeiter Portal? It is a comprehensive HR tool that helps small and medium-sized businesses efficiently manage their staff. From scheduling to facilitating internal communication, this portal is the organizational backbone for many businesses.",
        "adata_year_learnings": "This year at Adata not only taught me about technology; it allowed me to understand the tangible impact a well-designed software can have on users' work lives.",
        "contributions_title": "Some contributions I made",
        "redesign_ui": "Redesigned parts of the Portal's UI with ReactJS to improve the user experience by integrating libraries like KendoUI and Bootstrap.",
        "backend_features": "Updated and implemented new backend features in ASP.NET Core MVC to meet client needs.",
        "mobile_development_flutter": "Developed mobile applications in Flutter using Dart, connecting components to backend systems in .NET through RESTful APIs.",
        "database_optimizations": "Used LINQ and HeidiSQL for efficient database queries and improved performance, ensuring scalability and data optimization.",
        "scrum_practices": "Worked with Scrum methodologies, managing tasks in JIRA, participating in code reviews, and applying best development practices.",
        "return_button": "Back"
    }
}
