{
    "Home":{
        "welcome": "¡Hola🖖!",
        "i_am": "Soy Ben",
        "about_one": "Desarrollador Full Stack",
        "about_two": "Diseñador UI",
        "my_stack": "Mi Stack",
        "intro_one": "Soy desarrollador web especializado en .NET, React y Flutter. Apasionado por crear soluciones innovadoras que combinan funcionalidad y diseño.",
        "intro_two": "Con experiencia en proyectos frontend y backend, disfruto trabajando en equipo y superando retos tecnológicos para entregar productos de alta calidad.",
        "more_about_me": "Más sobre mí",
        "more_about_me_one": "Desde jugar con Arduinos hasta desarrollar soluciones en Alemania: Mi trayectoria combina curiosidad, tecnología y una pasión por crear desarrollos impactantes.",
        "my_exp": "Mi experiencia",
        "available": "Disponible",
        "adata_name": "Adata Software GmbH",
        "net_dev": "Desarrollador ASP.NET Core",
        "adata_time_span": "Julio 2023 - Junio 2024"
    },
    "AboutMe":{
        "about_me": "Sobre mí",
        "born_in_munich": "Nací en Munich, Alemania, y fui criado en Argentina.",
        "passion_technology_books": "Desde pequeño me apasiona la tecnología y los libros de historia (y los autos).",
        "curiosity_how_things_work": "Siempre me preguntaba como funcionaba el televisor que teníamos en el living o la radio del auto, el como las cosas iban evolucionando y mejorando.",
        "teenage_internet_games": "Mi adolescencia fue marcada por el internet y los videojuegos. Y en el club Interact de mi ciudad encontré mi lugar diseñando posts para el comité de relaciones publicas.",
        "student_exchange_bremen": "Fue a través de Interact que participe de un intercambio estudiantil en Alemania, allí estuve 1 año en Bremen.",
        "pandemic_change_programming": "Ya de vuelta en Tucumán y en la universidad, la pandemia me encontró sin mucho animo estudiando economía. Fue entonces que comencé a adentrarme en la programación y el diseño de interfaces.",
        "exploring_react_dotnet_ui": "A través de cursos y mucho aprendizaje por mi cuenta, fui explorando React, .NET y diseño UI, áreas que rápidamente se convirtieron en mi pasión y en el enfoque de mi desarrollo profesional.",
        "working_holiday_visa": "Deseoso de visitar nuevamente Alemania, aplique a una visa working-holiday. Una vez ahí, trabajé durante un año en Adata Software GmbH en Verden, Baja Sajonia.",
        "developing_hr_software": "Me dediqué al desarrollo y soporte del Mitarbeiter Portal, un software de recursos humanos que ayuda a pequeñas y medianas empresas a gestionar su personal.",
        "facing_challenges": "Durante ese tiempo, me enfrenté a desafíos técnicos (lingüísticos) y creativos, pero cada tarea me dejó una enorme satisfacción.",
        "current_goal": "Mi objetivo actual",
        "current_learning_focus": "Estoy enfocado en seguir aprendiendo en las áreas donde necesito más preparación y certificar mis conocimientos.",
        "short_term_goal": "Mi meta a corto plazo es dominar el proceso de hosting y publicación de aplicaciones, mientras refuerzo mis habilidades en .NET y ReactJS.",
        "long_term_goal": "A largo plazo, aspiro a liderar equipos de desarrollo y guiar a otros desarrolladores juniors, porque creo que mi experiencia y enfoque pueden marcar una diferencia en su crecimiento profesional.",
        "return_button": "Volver"
    },
	"Exp":{
		"adata_title": "Adata Software Gmbh",
		"adata_time_span": "JUL '23 – JUN '24",
		"adata_description": "Trabajé un año para Adata de forma presencial en Verden (Baja Sajonia). Allí trabajé junto a 2 desarrolladores en el desarrollo y soporte del Mitarbeiter Portal.",
		"what_is_mitarbeiter_portal": "¿Qué es el Mitarbeiter Portal? Es una herramienta integral de recursos humanos que ayuda a pequeñas y medianas empresas a gestionar su personal de manera eficiente. Desde administrar horarios hasta facilitar la comunicación interna, este portal es el corazón organizativo para muchos negocios.",
		"adata_year_learnings": "Este año en Adata no solo me enseñó sobre tecnología; me permitió comprender el impacto tangible que un software bien diseñado puede tener en la vida laboral de sus usuarios.",
		"contributions_title": "Algunas de las contribuciones que hice",
		"redesign_ui": "Rediseñar partes de la UI del Portal con ReactJS para mejorar la experiencia del usuario integrando bibliotecas como KendoUI y Bootstrap.",
		"backend_features": "Actualizar e implementar nuevas funcionalidades del backend de ASP.NET Core MVC para cumplir con las necesidades de los clientes.",
		"mobile_development_flutter": "Desarrollo móvil en Flutter utilizando Dart, conectando componentes con sistemas backend en .NET a través de APIs RESTful.",
		"database_optimizations": "Utilizar LINQ y HeidiSQL para realizar consultas eficientes a la base de datos y mejorar el rendimiento, asegurando escalabilidad y optimización de datos.",
		"scrum_practices": "Trabajar con metodologías Scrum, gestionando tareas en JIRA, participando en code-reviews y aplicando mejores prácticas de desarrollo.",
		"return_button": "Volver"
	},
    "Footer":{
        "des_dev": "Diseño & Desarrollo",
        "my_name": "Eduardo Benjamín López Avila",
        "build_with": "Construido con React, Next.js y Material Tailwind.",
        "copy": "©2025"
    }
}